### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # kubernetes_secret.influxdb_auth will be created
+   resource "kubernetes_secret" "influxdb_auth" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "influxdb-auth"
+           namespace        = "seichi-minecraft"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.onp_cluster_internal_credentials.random_password.influxdb_admin_password will be created
+   resource "random_password" "influxdb_admin_password" {
+       bcrypt_hash = (sensitive value)
+       id          = (known after apply)
+       length      = 48
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (sensitive value)
+       special     = true
+       upper       = true
    }

  # module.onp_cluster_internal_credentials.random_password.influxdb_admin_token will be created
+   resource "random_password" "influxdb_admin_token" {
+       bcrypt_hash = (sensitive value)
+       id          = (known after apply)
+       length      = 48
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (sensitive value)
+       special     = true
+       upper       = true
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>